app/controllers/posts_controller.rb

SELECT * FROM `posts` LIMIT 0, 20
---
  def index
    @posts = Post.paginate(:page => params[:page], :per_page => POSTS_PER_PAGE)